Revit 2027 API
FabricationConfiguration.GetMaterialGUID Method
 Gets the material GUID by its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid GetMaterialGUID(
	int materialId
)
Public Function GetMaterialGUID (
	materialId As Integer
) As Guid
public:
Guid GetMaterialGUID(
	int materialId
)
member GetMaterialGUID :
        materialId : int -> Guid
Parameters
materialId Int32
 The material identifier.
Return Value
Guid
 The material GUID. Returns empty GUID if not found.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace